Revit 2027 API
ExportLinetypeTable.Add Method
 Inserts a (key, info) pair into Export line type table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Add(
	ExportLinetypeKey exportLinetypeKey,
	ExportLinetypeInfo exportLinetypeInfo
)
Public Sub Add (
	exportLinetypeKey As ExportLinetypeKey,
	exportLinetypeInfo As ExportLinetypeInfo
)
public:
void Add(
	ExportLinetypeKey^ exportLinetypeKey,
	ExportLinetypeInfo^ exportLinetypeInfo
)
member Add :
        exportLinetypeKey : ExportLinetypeKey *
        exportLinetypeInfo : ExportLinetypeInfo -> unit
Parameters
exportLinetypeKey ExportLinetypeKey
 The export line type Key to be added.
exportLinetypeInfo ExportLinetypeInfo
 The export line type info to be added.
Exceptions
Exception | Condition
ArgumentException |  The key already exists in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace